7767517
54 62
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216
Swish                    silu_22                  1 1 1 2
Split                    splitncnn_0              1 2 2 3 4
Convolution              conv_1                   1 1 4 5 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_23                  1 1 5 6
Convolution              conv_2                   1 1 6 7 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
BinaryOp                 add_0                    2 1 3 7 8 0=0
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_3                   1 1 10 11 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_24                  1 1 11 12
Convolution              conv_4                   1 1 12 13 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
BinaryOp                 add_1                    2 1 9 13 14 0=0
Convolution              conv_5                   1 1 14 15 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=20736
Swish                    silu_25                  1 1 15 16
Convolution              conv_6                   1 1 16 17 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split                    splitncnn_2              1 2 17 18 19
Convolution              conv_7                   1 1 19 20 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_26                  1 1 20 21
Convolution              conv_8                   1 1 21 22 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_2                    2 1 18 22 23 0=0
Split                    splitncnn_3              1 2 23 24 25
Convolution              conv_9                   1 1 25 26 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_27                  1 1 26 27
Convolution              conv_10                  1 1 27 28 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_3                    2 1 24 28 29 0=0
Split                    splitncnn_4              1 2 29 30 31
Convolution              conv_11                  1 1 31 32 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_28                  1 1 32 33
Convolution              conv_12                  1 1 33 34 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
BinaryOp                 add_4                    2 1 30 34 35 0=0
Convolution              conv_13                  1 1 35 36 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=82944
Swish                    silu_29                  1 1 36 37
Convolution              conv_14                  1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Split                    splitncnn_5              1 2 38 39 40
Convolution              conv_15                  1 1 40 41 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_30                  1 1 41 42
Convolution              conv_16                  1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_5                    2 1 39 43 44 0=0
Split                    splitncnn_6              1 2 44 45 46
Convolution              conv_17                  1 1 46 47 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_31                  1 1 47 48
Convolution              conv_18                  1 1 48 49 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_6                    2 1 45 49 50 0=0
Split                    splitncnn_7              1 2 50 51 52
Convolution              conv_19                  1 1 52 53 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_32                  1 1 53 54
Convolution              conv_20                  1 1 54 55 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_7                    2 1 51 55 56 0=0
Reshape                  reshape_36               1 1 56 57 0=-1 1=512
Permute                  permute_35               1 1 57 58 0=1
LSTM                     lstm_34                  1 1 58 59 0=512 1=2097152 2=2 3=512
InnerProduct             linear_21                1 1 59 60 0=8210 1=1 2=8407040
Softmax                  softmax_33               1 1 60 out0 0=1 1=1
